app/controllers/users_controller.rb

SELECT  "users".* FROM "users"   ORDER BY created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users"
---
  def index
    @users = User.order('created_at DESC').paginate(page: params[:page], per_page: 30)

SELECT  "users".* FROM "users"  WHERE "users"."id" = 38  ORDER BY "users"."id" ASC LIMIT 1
---
  def update

  	puts("update path")

    @user = User.find(current_user.id)

DELETE FROM "users" WHERE "users"."email" = '5@5.com'
---
	  	redirect_to new_user_session_path
	  else
	  	puts("failure")
	  	User.where(:email=>current_user["email"]).delete_all

SELECT  "users".* FROM "users"  WHERE "users"."id" = 39  ORDER BY "users"."id" ASC LIMIT 1
---
   def aadhaarotp1
    puts(params)
     @user = User.find(current_user.id)